EdgeTX/edgetx/radio/src/targets/common/arm/stm32/sdcard_spi.cpp
/*
 * Copyright (C) EdgeTX
 *
 * Based on code named
 *   opentx - https://github.com/opentx/opentx
 *   th9x - http://code.google.com/p/th9x
 *   er9x - http://code.google.com/p/er9x
 *   gruvin9x - http://code.google.com/p/gruvin9x
 *
 * License GPLv2: http://www.gnu.org/licenses/gpl-2.0.html
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#include "sdcard_spi.h"
#include "stm32_spi.h"
#include "timers_driver.h"

#include "debug.h"
#include "crc.h"

#include <string.h>

#define SD_SPI_CLK_400K (400000UL)

#if !defined(SD_SPI_CLK_MAX)
#define SD_SPI_CLK_MAX (25000000UL)
#endif

// Disable CRC support by default
//
// #if !defined(SD_CARD_SPI_DISABLE_CRC)
// #define SD_CARD_SPI_ENABLE_CRC
// #endif

#define US_PER_MS                   (1000UL)
#define INIT_CMD_RETRY_US           (250 * US_PER_MS)
#define INIT_CMD0_RETRY_US          (100UL)
#define R1_POLLING_RETRY_US         (100 * US_PER_MS)
#define SD_DATA_TOKEN_RETRY_US      (100 * US_PER_MS)
#define SD_WAIT_FOR_NOT_BUSY_US     (250 * US_PER_MS)

#define SD_BLOCK_READ_CMD_RETRY_US  (100UL)
#define SD_BLOCK_WRITE_CMD_RETRY_US (100UL)

#define SD_CARD_DUMMY_BYTE (0xFF)

typedef enum {
  SD_INIT_START,
  SD_INIT_SPI_POWER_SEQ,
  SD_INIT_SEND_CMD0,
  SD_INIT_SEND_CMD8,
  SD_INIT_CARD_UNKNOWN,
  SD_INIT_SEND_ACMD41_HCS,
  SD_INIT_SEND_ACMD41,
  SD_INIT_SEND_CMD1,
  SD_INIT_SEND_CMD58,
  SD_INIT_SEND_CMD16,
  SD_INIT_ENABLE_CRC,
  SD_INIT_READ_CID,
  SD_INIT_READ_CSD,
  SD_INIT_SET_MAX_SPI_SPEED,
  SD_INIT_FINISH
} sd_init_fsm_state_t;

static sdcard_spi_t _sdcard_spi = {nullptr, false};

static bool _wait_for_not_busy(const stm32_spi_t* spi, uint32_t retry_us)
{
  uint32_t timeout = timersGetUsTick();

  do {
    uint8_t read_byte = stm32_spi_transfer_byte(spi, SD_CARD_DUMMY_BYTE);
    if (read_byte == 0xFF) {
      TRACE("_wait_for_not_busy: [OK]");
      return true;
    } else {
      TRACE("_wait_for_not_busy: [BUSY]");
    }
  } while (timersGetUsTick() - timeout < retry_us);

  TRACE("_wait_for_not_busy: [FAILED]");
  return false;
}

static uint8_t _crc_7(const uint8_t* data, int n)
{
  uint8_t crc = 0;

  for (int i = 0; i < n; i++) {
    uint8_t d = data[i];
    for (int j = 0; j < 8; j++) {
      crc <<= 1;
      if ((d & 0x80) ^ (crc & 0x80)) {
        crc ^= 0x09;
      }
      d <<= 1;
    }
  }
  return (crc << 1) | 1;
}

static inline uint16_t _transfer_bytes(const stm32_spi_t* spi, const uint8_t* out,
                                       uint8_t* in, uint16_t length)
{
  return stm32_spi_transfer_bytes(spi, out, in, length);
}

static inline void _send_dummy_byte(const stm32_spi_t* spi)
{
  stm32_spi_transfer_byte(spi, SD_CARD_DUMMY_BYTE);
}

static inline uint8_t _wait_for_r1(const stm32_spi_t* spi, uint32_t retry_us)
{
  uint32_t timeout = timersGetUsTick();
  uint8_t r1;

  do {
    r1 = stm32_spi_transfer_byte(spi, SD_CARD_DUMMY_BYTE);
    TRACE("_wait_for_r1: r1=0x%02x", r1);

    if (R1_VALID(r1)) {
      TRACE("_wait_for_r1: R1_VALID");
      return r1;
    }

  } while (timersGetUsTick() - timeout < retry_us);

  TRACE("_wait_for_r1: [TIMEOUT]");
  return r1;
}

static inline bool _wait_for_token(const stm32_spi_t* spi, uint8_t token, uint32_t retry_us)
{
  uint32_t timeout = timersGetUsTick();

  do {
    uint8_t read_byte = 0;
    read_byte = stm32_spi_transfer_byte(spi, SD_CARD_DUMMY_BYTE);
    if (read_byte == token) {
      TRACE("_wait_for_token: [MATCH]");
      return true;
    }
    else {
      TRACE("_wait_for_token: [NO MATCH] (0x%02x)", read_byte);
    }
    
  } while (timersGetUsTick() - timeout < retry_us);

  return false;
}

static uint8_t sdcard_spi_send_cmd(const stm32_spi_t* spi, uint8_t sd_cmd_idx,
                                   uint32_t argument, uint32_t retry_us)
{
  uint8_t r1_resu;
  uint8_t cmd_data[6];

  cmd_data[0] = SD_CMD_PREFIX_MASK | sd_cmd_idx;
  cmd_data[1] = argument >> (3 * 8);
  cmd_data[2] = (argument >> (2 * 8)) & 0xFF;
  cmd_data[3] = (argument >> 8) & 0xFF;
  cmd_data[4] = argument & 0xFF;
  cmd_data[5] = _crc_7(cmd_data, sizeof(cmd_data) - 1);

  uint32_t timeout = timersGetUsTick();
  do {
    if (!_wait_for_not_busy(spi, SD_WAIT_FOR_NOT_BUSY_US)) {
      TRACE(
          "sdcard_spi_send_cmd: timeout while waiting for bus to be not busy!");
      r1_resu = SD_INVALID_R1_RESPONSE;
      continue;
    }

    if (_transfer_bytes(spi, cmd_data, 0, sizeof(cmd_data)) != sizeof(cmd_data)) {
      TRACE("sdcard_spi_send_cmd: _transfer_bytes: send cmd [%d]: [ERROR]",
            sd_cmd_idx);
      r1_resu = SD_INVALID_R1_RESPONSE;
      continue;
    }

    /* received byte after cmd12 is a dummy byte and should be ignored */
    if (sd_cmd_idx == SD_CMD_12) {
      _send_dummy_byte(spi);
    }

    r1_resu = _wait_for_r1(spi, R1_POLLING_RETRY_US);

    if (R1_VALID(r1_resu)) {
      break;
    } else {
      TRACE("sdcard_spi_send_cmd: R1_TIMEOUT (0x%02x)", r1_resu);
      r1_resu = SD_INVALID_R1_RESPONSE;
    }

  } while (timersGetUsTick() - timeout < retry_us);

  return r1_resu;
}

static uint8_t sdcard_spi_send_acmd(const stm32_spi_t* spi, uint8_t sd_cmd_idx,
                                    uint32_t argument, uint32_t retry_us)
{
  uint32_t timeout = timersGetUsTick();
  uint8_t r1_resu;

  do {
    r1_resu = sdcard_spi_send_cmd(spi, SD_CMD_55, SD_CMD_NO_ARG, 0);
    if (R1_VALID(r1_resu) && !R1_ERROR(r1_resu)) {
      r1_resu = sdcard_spi_send_cmd(spi, sd_cmd_idx, argument, 0);

      if (R1_VALID(r1_resu) && !R1_ERROR(r1_resu)) {
        return r1_resu;
      } else {
        TRACE("ACMD%02d: [ERROR / NO RESPONSE]", sd_cmd_idx);
      }
    } else {
      TRACE("CMD55: [ERROR / NO RESPONSE]");
    }
  } while (timersGetUsTick() - timeout < retry_us);

  TRACE("sdcard_spi_send_acmd: [TIMEOUT]");
  return r1_resu;
}

static sd_rw_response_t _read_cid(const stm32_spi_t* spi, sdcard_info_t* card);
static sd_rw_response_t _read_csd(const stm32_spi_t* spi, sdcard_info_t* card);

static sd_init_fsm_state_t _init_sd_fsm_step(const stm32_spi_t* spi,
					     sdcard_info_t* card,
                                             sd_init_fsm_state_t state)
{
  switch (state) {
    case SD_INIT_START:
      TRACE("SD_INIT_START");
      stm32_spi_init(spi);
      stm32_spi_set_max_baudrate(spi, SD_SPI_CLK_400K);
      return SD_INIT_SPI_POWER_SEQ;

    case SD_INIT_SPI_POWER_SEQ:
      TRACE("SD_INIT_SPI_POWER_SEQ");
      {
	// wait minimum 1ms until card is powered
	uint32_t power_on_timeout = timersGetUsTick();
	while(timersGetUsTick() - power_on_timeout < US_PER_MS);
      }

      // unselect sdcard for power up sequence
      stm32_spi_unselect(spi);

      // powersequence: perform at least 74 clock cycles with mosi_pin being
      // high (same as sending dummy bytes with 0xFF)
      for (int i = 0; i < 10; i++) {
        stm32_spi_transfer_byte(spi, 0xff);
      }
      return SD_INIT_SEND_CMD0;

    case SD_INIT_SEND_CMD0:
      TRACE("SD_INIT_SEND_CMD0");
      stm32_spi_select(spi);
      {
	uint8_t cmd0_r1 = sdcard_spi_send_cmd(spi, SD_CMD_0, SD_CMD_NO_ARG, INIT_CMD0_RETRY_US);
	stm32_spi_unselect(spi);

	if (R1_VALID(cmd0_r1) && !R1_ERROR(cmd0_r1) && R1_IDLE_BIT_SET(cmd0_r1)) {
	  TRACE("CMD0: [OK]");
	  return SD_INIT_ENABLE_CRC;
	}
      }

      return SD_INIT_CARD_UNKNOWN;

