EdgeTX/edgetx/radio/src/targets/common/arm/stm32/sdcard_spi.cpp
    case SD_INIT_ENABLE_CRC:
#if defined(SD_CARD_SPI_ENABLE_CRC)
      TRACE("SD_INIT_ENABLE_CRC");
      stm32_spi_select(spi);
      {
	uint8_t r1 = sdcard_spi_send_cmd(spi, SD_CMD_59, SD_CMD_59_ARG_EN,
					 INIT_CMD_RETRY_US);
	stm32_spi_unselect(spi);

	if (R1_VALID(r1) && !R1_ERROR(r1)) {
	  TRACE("CMD59: [OK]");
	  return SD_INIT_SEND_CMD8;
	}
      }
      return SD_INIT_CARD_UNKNOWN;
 #endif
    /* if SD_CARD_SPI_ENABLE_CRC is not enabled,
       let's continue directly with CMD8
     */

    case SD_INIT_SEND_CMD8:
      TRACE("SD_INIT_SEND_CMD8");
      stm32_spi_select(spi);
      {
	int cmd8_arg = (SD_CMD_8_VHS_2_7_V_TO_3_6_V << 8) | SD_CMD_8_CHECK_PATTERN;
	uint8_t cmd8_r1 = sdcard_spi_send_cmd(spi, SD_CMD_8, cmd8_arg, INIT_CMD_RETRY_US);

	if (R1_VALID(cmd8_r1) && !R1_ERROR(cmd8_r1)) {
	  TRACE("CMD8: [OK] --> reading remaining bytes for R7");

	  uint8_t r7[4];

	  if (_transfer_bytes(spi, 0, &r7[0], sizeof(r7)) == sizeof(r7)) {
	    TRACE("R7 response: 0x%02x 0x%02x 0x%02x 0x%02x", r7[0], r7[1], r7[2], r7[3]);
	    /* check if lower 12 bits (voltage range and check pattern) of
	       response and arg are equal to verify compatibility and
	       communication is working properly */
	    if (((r7[2] & 0x0F) == ((cmd8_arg >> 8) & 0x0F)) &&
		(r7[3] == (cmd8_arg & 0xFF))) {
	      TRACE("CMD8: [R7 MATCH]");
	      return SD_INIT_SEND_ACMD41_HCS;
	    }

	    TRACE("CMD8: [R7 MISMATCH]");
	  } else {
	    TRACE("CMD8: _transfer_bytes (R7): [ERROR]");
	  }

	  stm32_spi_unselect(spi);
	  return SD_INIT_CARD_UNKNOWN;
	}
      }

      TRACE("CMD8: [ERROR / NO RESPONSE]");
      return SD_INIT_SEND_ACMD41;

    case SD_INIT_CARD_UNKNOWN:
      TRACE("SD_INIT_CARD_UNKNOWN");
      card->card_type = SD_UNKNOWN;
      return SD_INIT_FINISH;

    case SD_INIT_SEND_ACMD41_HCS:
      TRACE("SD_INIT_SEND_ACMD41_HCS");
      {
	uint32_t acmd41_hcs_retry_timeout = timersGetUsTick();
	do {
	  uint8_t acmd41hcs_r1 = sdcard_spi_send_acmd(spi, SD_CMD_41, SD_ACMD_41_ARG_HC, 0);
	  if (R1_VALID(acmd41hcs_r1) && !R1_ERROR(acmd41hcs_r1) &&
	      !R1_IDLE_BIT_SET(acmd41hcs_r1)) {
	    TRACE("ACMD41: [OK]");
	    return SD_INIT_SEND_CMD58;
	  }
	} while (timersGetUsTick() - acmd41_hcs_retry_timeout < INIT_CMD_RETRY_US);
      }
      stm32_spi_unselect(spi);
      return SD_INIT_CARD_UNKNOWN;

    case SD_INIT_SEND_ACMD41:
      TRACE("SD_INIT_SEND_ACMD41");
      {
	uint32_t acmd41_retry_timeout = timersGetUsTick();
	do {
	  uint8_t acmd41_r1 =
            sdcard_spi_send_acmd(spi, SD_CMD_41, SD_CMD_NO_ARG, 0);
	  if (R1_VALID(acmd41_r1) && !R1_ERROR(acmd41_r1) &&
	      !R1_IDLE_BIT_SET(acmd41_r1)) {
	    TRACE("ACMD41: [OK]");
	    card->use_block_addr = false;
	    card->card_type = SD_V1;
	    return SD_INIT_SEND_CMD16;
	  }
	} while (timersGetUsTick() - acmd41_retry_timeout < INIT_CMD_RETRY_US);
      }
      TRACE("ACMD41: [ERROR]");
      return SD_INIT_SEND_CMD1;

    case SD_INIT_SEND_CMD1:
      TRACE("SD_INIT_SEND_CMD1");
      TRACE("COULD TRY CMD1 (for MMC-card)-> currently not supported");
      stm32_spi_unselect(spi);
      return SD_INIT_CARD_UNKNOWN;

    case SD_INIT_SEND_CMD58:
      TRACE("SD_INIT_SEND_CMD58");
      {
	uint8_t cmd58_r1 = sdcard_spi_send_cmd(spi, SD_CMD_58, SD_CMD_NO_ARG,
					       INIT_CMD_RETRY_US);
	if (R1_VALID(cmd58_r1) && !R1_ERROR(cmd58_r1)) {
	  TRACE("CMD58: [OK]");
	  card->card_type = SD_V2;

	  uint8_t r3[4];
	  if (_transfer_bytes(spi, 0, r3, sizeof(r3)) == sizeof(r3)) {
	    uint32_t ocr = ((uint32_t)r3[0] << (3 * 8)) |
	      ((uint32_t)r3[1] << (2 * 8)) | (r3[2] << 8) | r3[3];
	    TRACE("R3 RESPONSE: 0x%02x 0x%02x 0x%02x 0x%02x",
		  r3[0], r3[1], r3[2], r3[3]);
	    TRACE("OCR: 0x%" PRIx32, ocr);

	    if ((ocr & SYSTEM_VOLTAGE) != 0) {
	      TRACE("OCR: SYS VOLTAGE SUPPORTED");

	      /* if power up outine is finished */
	      if ((ocr & OCR_POWER_UP_STATUS) != 0) {
		TRACE("OCR: POWER UP ROUTINE FINISHED");
		/* if sd card is sdhc */
		if ((ocr & OCR_CCS) != 0) {
		  TRACE("OCR: CARD TYPE IS SDHC (SD_V2 with block addressing)");
		  card->use_block_addr = true;
		  stm32_spi_unselect(spi);
		  return SD_INIT_READ_CID;
		}

		TRACE("OCR: CARD TYPE IS SDSC (SD_v2 with byte addressing)");
		card->use_block_addr = false;
		return SD_INIT_SEND_CMD16;
	      }

	      TRACE("OCR: POWER UP ROUTINE NOT FINISHED!");
	      /* poll status till power up is finished */
	      return SD_INIT_SEND_CMD58;
	    }

	    TRACE("OCR: SYS VOLTAGE NOT SUPPORTED!");
	  }

	  TRACE("CMD58 response: [READ ERROR]");
	}
      }

      TRACE("CMD58: [ERROR]");
      stm32_spi_unselect(spi);
      return SD_INIT_CARD_UNKNOWN;

    case SD_INIT_SEND_CMD16:
      TRACE("SD_INIT_SEND_CMD16\n");
      {
	uint8_t r1_16 = sdcard_spi_send_cmd(spi, SD_CMD_16, SD_HC_BLOCK_SIZE,
					    INIT_CMD_RETRY_US);
	if (R1_VALID(r1_16) && !R1_ERROR(r1_16)) {
	  TRACE("CARD TYPE IS SDSC (SD_V1 with byte addressing)");
	  stm32_spi_unselect(spi);
	  return SD_INIT_READ_CID;
	} else {
	  stm32_spi_unselect(spi);
	  return SD_INIT_CARD_UNKNOWN;
	}
      }
      // unreachable
      break;

    case SD_INIT_READ_CID:
      TRACE("SD_INIT_READ_CID");
      if (_read_cid(spi, card) == SD_RW_OK) {
	return SD_INIT_READ_CSD;
      } else {
	TRACE("reading cid register failed!");
	return SD_INIT_CARD_UNKNOWN;
      }

    case SD_INIT_READ_CSD:
      TRACE("SD_INIT_READ_CSD");
      if (_read_csd(spi, card) == SD_RW_OK) {
	if (card->csd_structure == SD_CSD_V1) {
	  TRACE("csd_structure is version 1");
	} else if (card->csd_structure == SD_CSD_V2) {
	  TRACE("csd_structure is version 2");
	}
	return SD_INIT_SET_MAX_SPI_SPEED;
      } else {
	TRACE("reading csd register failed!");
	return SD_INIT_CARD_UNKNOWN;
      }

    case SD_INIT_SET_MAX_SPI_SPEED:
      TRACE("SD_INIT_SET_MAX_SPI_SPEED");
      stm32_spi_set_max_baudrate(spi, SD_SPI_CLK_MAX);
      TRACE("SD_INIT_SET_MAX_SPI_SPEED: [OK]");
      return SD_INIT_FINISH;

    default:
      TRACE("SD-INIT-FSM REACHED INVALID STATE!\n");
      return SD_INIT_CARD_UNKNOWN;
  }
}

int sdcard_spi_init(const stm32_spi_t* spi, sdcard_info_t* card)
{
  sd_init_fsm_state_t state = SD_INIT_START;

  do {
    state = _init_sd_fsm_step(spi, card, state);
  } while (state != SD_INIT_FINISH);

  if (card->card_type != SD_UNKNOWN) {
    _sdcard_spi.spi = spi;
    _sdcard_spi.use_block_addr = card->use_block_addr;
    return SDCARD_SPI_OK;
  }

  return SDCARD_SPI_INIT_ERROR;
}

static sd_rw_response_t _read_data_packet(const stm32_spi_t* spi, uint8_t token,
                                          uint8_t *data, uint16_t size)
{
  TRACE("_read_data_packet: size: %" PRIu16, size);
  if (_wait_for_token(spi, token, SD_DATA_TOKEN_RETRY_US) == true) {
    TRACE("_read_data_packet: [GOT TOKEN]");
  }
  else {
    TRACE("_read_data_packet: [GOT NO TOKEN]");
    return SD_RW_NO_TOKEN;
  }

  if (stm32_spi_dma_receive_bytes(spi, data, size) == size) {

    uint8_t crc_bytes[2];
    if (_transfer_bytes(spi, 0, crc_bytes, sizeof(crc_bytes)) == sizeof(crc_bytes)) {

#if defined(SD_CARD_SPI_ENABLE_CRC)
      uint16_t data_crc16 = (crc_bytes[0] << 8) | crc_bytes[1];
      if (crc16(CRC_1021, data, size) != data_crc16) {
	TRACE("_read_data_packet: [CRC_MISMATCH]");
	return SD_RW_CRC_MISMATCH;
      }
#endif
      TRACE("_read_data_packet: [OK]");
      return SD_RW_OK;
    }

