EdgeTX/edgetx/radio/src/targets/common/arm/stm32/sdcard_spi.cpp
    TRACE("_read_data_packet: _transfer_bytes [RX_TX_ERROR] (while transmitting crc)");
    return SD_RW_RX_TX_ERROR;
  }

  TRACE("_read_data_packet: _transfer_bytes [RX_TX_ERROR] (while transmitting payload)");
  return SD_RW_RX_TX_ERROR;
}

static uint16_t _read_blocks(const sdcard_spi_t* card, uint8_t cmd_idx,
                             uint32_t bladdr, uint8_t* data,
                             uint16_t blsz, uint16_t nbl,
                             sd_rw_response_t* state)
{
  const auto* spi = card->spi;
  stm32_spi_select(spi);
  uint16_t reads = 0;

  uint32_t addr = card->use_block_addr ? bladdr : (bladdr * SD_HC_BLOCK_SIZE);
  uint8_t cmd_r1_resu = sdcard_spi_send_cmd(spi, cmd_idx, addr, SD_BLOCK_READ_CMD_RETRY_US);

  if (R1_VALID(cmd_r1_resu) && !R1_ERROR(cmd_r1_resu)) {
    TRACE("_read_blocks: send CMD%d: [OK]", cmd_idx);

    for (uint16_t i = 0; i < nbl; i++) {
      *state = _read_data_packet(spi, SD_DATA_TOKEN_CMD_17_18_24, &(data[i * blsz]), blsz);

      if (*state != SD_RW_OK) {
	TRACE("_read_blocks: _read_data_packet: [FAILED]");
	stm32_spi_unselect(spi);
	return reads;
      }
      else {
	reads++;
      }
    }

    /* if this was a multi-block read */
    if (cmd_idx == SD_CMD_18) {
      cmd_r1_resu = sdcard_spi_send_cmd(spi, SD_CMD_12, 0, 1);

      if (R1_VALID(cmd_r1_resu) && !R1_ERROR(cmd_r1_resu)) {
        TRACE("_read_blocks: read multi (%d) blocks [OK]", nbl);
	*state = SD_RW_OK;
      }
      else {
	TRACE("_read_blocks: send CMD12: [RX_TX_ERROR]");
	*state =  SD_RW_RX_TX_ERROR;
      }
    }
    else {
      TRACE("_read_blocks: read single block [OK]");
      *state = SD_RW_OK;
    }
  }
  else {
    TRACE("_read_blocks: send CMD%d: [RX_TX_ERROR]", cmd_idx);
    *state = SD_RW_RX_TX_ERROR;
  }

  stm32_spi_unselect(spi);
  return reads;
}

int sdcard_spi_read_blocks(uint32_t blockaddr, uint8_t* data,
                           uint16_t blocksize, uint16_t nblocks,
                           sd_rw_response_t* state)
{
  *state = SD_RW_OK;
  if (nblocks > 1) {
    return _read_blocks(&_sdcard_spi, SD_CMD_18, blockaddr, data, blocksize,
                        nblocks, state);
  } else {
    return _read_blocks(&_sdcard_spi, SD_CMD_17, blockaddr, data, blocksize,
                        nblocks, state);
  }
}

static sd_rw_response_t _write_data_packet(const stm32_spi_t* spi, uint8_t token,
                                           const uint8_t *data, uint16_t size)
{
  stm32_spi_transfer_byte(spi, token);

  if (stm32_spi_dma_transmit_bytes(spi, data, size) != size) {
    TRACE("_write_data_packet: [RX_TX_ERROR] (while transmitting payload)");
    return SD_RW_RX_TX_ERROR;
  }

#if defined(SD_CARD_SPI_ENABLE_CRC)
  uint16_t data_crc16 = crc16(CRC_1021, data, size);
  uint8_t crc[sizeof(uint16_t)] = {
    (uint8_t)(data_crc16 >> 8),
    (uint8_t)(data_crc16 & 0xFF)
  };
#else
  uint8_t crc[sizeof(uint16_t)] = { 0xFF, 0xFF };
#endif

  if (_transfer_bytes(spi, crc, 0, sizeof(crc)) != sizeof(crc)) {
    TRACE("_write_data_packet: [RX_TX_ERROR] (while transmitting CRC16)");
    return SD_RW_RX_TX_ERROR;
  }

  uint8_t data_response = stm32_spi_transfer_byte(spi, SD_CARD_DUMMY_BYTE);

  TRACE("_write_data_packet: DATA_RESPONSE: 0x%02x", data_response);

  if (!DATA_RESPONSE_IS_VALID(data_response)) {
    TRACE("_write_data_packet: DATA_RESPONSE invalid");
    return SD_RW_RX_TX_ERROR;
  }

  if (DATA_RESPONSE_ACCEPTED(data_response)) {
    TRACE("_write_data_packet: DATA_RESPONSE: [OK]");
    return SD_RW_OK;
  }

  if (DATA_RESPONSE_WRITE_ERR(data_response)) {
    TRACE("_write_data_packet: DATA_RESPONSE: [WRITE_ERROR]");
  }
    
  if (DATA_RESPONSE_CRC_ERR(data_response)) {
    TRACE("_write_data_packet: DATA_RESPONSE: [CRC_ERROR]");
  }

  return SD_RW_WRITE_ERROR;
}

static uint16_t _write_blocks(const sdcard_spi_t* card, uint8_t cmd_idx,
                              uint32_t bladdr, const uint8_t *data,
                              uint16_t blsz, uint16_t nbl,
                              sd_rw_response_t *state)
{
  const auto* spi = card->spi;
  stm32_spi_select(spi);
  uint16_t written = 0;

  uint32_t addr = card->use_block_addr ? bladdr : (bladdr * SD_HC_BLOCK_SIZE);
  uint8_t cmd_r1_resu = sdcard_spi_send_cmd(spi, cmd_idx, addr, SD_BLOCK_WRITE_CMD_RETRY_US);

  if (R1_VALID(cmd_r1_resu) && !R1_ERROR(cmd_r1_resu)) {
    TRACE("_write_blocks: send CMD%d: [OK]", cmd_idx);

    uint8_t token;
    if (cmd_idx == SD_CMD_25) {
      token = SD_DATA_TOKEN_CMD_25;
    } else {
      token = SD_DATA_TOKEN_CMD_17_18_24;
    }

    for (uint16_t i = 0; i < nbl; i++) {
      sd_rw_response_t write_resu = _write_data_packet(spi, token, &(data[i * blsz]), blsz);
      if (write_resu != SD_RW_OK) {
	TRACE("_write_blocks: _write_data_packet: [FAILED]");
	stm32_spi_unselect(spi);
	*state = write_resu;
	return written;
      }
      if (!_wait_for_not_busy(spi, SD_WAIT_FOR_NOT_BUSY_US)) {
        TRACE("_write_blocks: _wait_for_not_busy: [FAILED]");
	stm32_spi_unselect(spi);
	*state = SD_RW_TIMEOUT;
	return written;
      }
      written++;
    }

    /* if this is a multi-block write it is needed to issue a stop
       command */
    if (cmd_idx == SD_CMD_25) {
      stm32_spi_transfer_byte(spi, SD_DATA_TOKEN_CMD_25_STOP);
      TRACE("_write_blocks: write multi (%d) blocks: [OK]", nbl);
      
      /* sd card needs dummy byte before we can wait for not-busy state */
      _send_dummy_byte(spi);
      if (!_wait_for_not_busy(spi, SD_WAIT_FOR_NOT_BUSY_US)) {
	stm32_spi_unselect(spi);
	*state = SD_RW_TIMEOUT;
      }
    }
    else {
      TRACE("_write_blocks: write single block: [OK]");
      *state = SD_RW_OK;
    }

    stm32_spi_unselect(spi);
    return written;
  }
  else {
    TRACE("_write_blocks: sdcard_spi_send_cmd: SD_CMD_ERROR_NO_RESP\n");
    stm32_spi_unselect(spi);
    *state = SD_RW_RX_TX_ERROR;
    return written;
  }
}

int sdcard_spi_write_blocks(uint32_t blockaddr, const uint8_t* data,
                            uint16_t blocksize, uint16_t nblocks,
                            sd_rw_response_t* state)
{
  *state = SD_RW_OK;
  if (nblocks > 1) {
    return _write_blocks(&_sdcard_spi, SD_CMD_25, blockaddr, data, blocksize,
                         nblocks, state);
  } else {
    return _write_blocks(&_sdcard_spi, SD_CMD_24, blockaddr, data, blocksize,
                         nblocks, state);
  }
}

static sd_rw_response_t _read_cid(const stm32_spi_t* spi, sdcard_info_t* card)
{
  uint8_t cid_raw_data[SD_SIZE_OF_CID_AND_CSD_REG];
  sd_rw_response_t state;

