EdgeTX/edgetx/radio/src/targets/common/arm/stm32/sdcard_spi.cpp
  sdcard_spi_t card_spi = { spi, card->use_block_addr };
  int nbl = _read_blocks(&card_spi, SD_CMD_10, 0, cid_raw_data, SD_SIZE_OF_CID_AND_CSD_REG,
			 SD_BLOCKS_FOR_REG_READ, &state);

  uint8_t crc7 = _crc_7(&(cid_raw_data[0]), SD_SIZE_OF_CID_AND_CSD_REG - 1);

  if (nbl == SD_BLOCKS_FOR_REG_READ) {
    if (crc7 == cid_raw_data[SD_SIZE_OF_CID_AND_CSD_REG - 1]) {
      card->cid.MID = cid_raw_data[0];
      memcpy(&card->cid.OID[0], &cid_raw_data[1], SD_SIZE_OF_OID);
      memcpy(&card->cid.PNM[0], &cid_raw_data[2], SD_SIZE_OF_PNM);
      card->cid.PRV = cid_raw_data[8];
      memcpy((uint8_t *)&card->cid.PSN, &cid_raw_data[9], 4);
      card->cid.MDT = (cid_raw_data[13] << 4) | cid_raw_data[14];
      card->cid.CID_CRC = cid_raw_data[15];
      TRACE("_read_cid: [OK]");
      return SD_RW_OK;
    }
    else {
      TRACE("_read_cid: [SD_RW_CRC_MISMATCH] (data-crc: 0x%02x | calc-crc: 0x%02x)",
	    cid_raw_data[SD_SIZE_OF_CID_AND_CSD_REG - 1], crc7);
      return SD_RW_CRC_MISMATCH;
    }
  }
  return state;
}

static sd_rw_response_t _read_csd(const stm32_spi_t* spi, sdcard_info_t* card)
{
  uint8_t c[SD_SIZE_OF_CID_AND_CSD_REG];
  sd_rw_response_t state;

  sdcard_spi_t card_spi = { spi, card->use_block_addr };
  int read_resu = _read_blocks(&card_spi, SD_CMD_9, 0, c, SD_SIZE_OF_CID_AND_CSD_REG,
			       SD_BLOCKS_FOR_REG_READ, &state);

  if (read_resu == SD_BLOCKS_FOR_REG_READ) {
    if (_crc_7(c, SD_SIZE_OF_CID_AND_CSD_REG - 1) == c[SD_SIZE_OF_CID_AND_CSD_REG - 1]) {
      if (SD_GET_CSD_STRUCTURE(c) == SD_CSD_V1) {
        card->csd.v1.CSD_STRUCTURE = c[0] >> 6;
        card->csd.v1.TAAC = c[1];
        card->csd.v1.NSAC = c[2];
        card->csd.v1.TRAN_SPEED = c[3];
        card->csd.v1.CCC = (c[4] << 4) | ((c[5] & 0xF0) >> 4);
        card->csd.v1.READ_BL_LEN = (c[5] & 0x0F);
        card->csd.v1.READ_BL_PARTIAL = (c[6] & (1 << 7)) >> 7;
        card->csd.v1.WRITE_BLK_MISALIGN = (c[6] & (1 << 6)) >> 6;
        card->csd.v1.READ_BLK_MISALIGN = (c[6] & (1 << 5)) >> 5;
        card->csd.v1.DSR_IMP = (c[6] & (1 << 4)) >> 4;
        card->csd.v1.C_SIZE = ((c[6] & 0x03) << 10) | (c[7] << 2) | (c[8] >> 6);
        card->csd.v1.VDD_R_CURR_MIN = (c[8] & 0x38) >> 3;
        card->csd.v1.VDD_R_CURR_MAX = (c[8] & 0x07);
        card->csd.v1.VDD_W_CURR_MIN = (c[9] & 0xE0) >> 5;
        card->csd.v1.VDD_W_CURR_MAX = (c[9] & 0x1C) >> 2;
        card->csd.v1.C_SIZE_MULT = ((c[9] & 0x03) << 1) | (c[10] >> 7);
        card->csd.v1.ERASE_BLK_EN = (c[10] & (1 << 6)) >> 6;
        card->csd.v1.SECTOR_SIZE = ((c[10] & 0x3F) << 1) | (c[11] >> 7);
        card->csd.v1.WP_GRP_SIZE = (c[11] & 0x7F);
        card->csd.v1.WP_GRP_ENABLE = c[12] >> 7;
        card->csd.v1.R2W_FACTOR = (c[12] & 0x1C) >> 2;
        card->csd.v1.WRITE_BL_LEN = (c[12] & 0x03) << 2 | (c[13] >> 6);
        card->csd.v1.WRITE_BL_PARTIAL = (c[13] & (1 << 5)) >> 5;
        card->csd.v1.FILE_FORMAT_GRP = (c[14] & (1 << 7)) >> 7;
        card->csd.v1.COPY = (c[14] & (1 << 6)) >> 6;
        card->csd.v1.PERM_WRITE_PROTECT = (c[14] & (1 << 5)) >> 5;
        card->csd.v1.TMP_WRITE_PROTECT = (c[14] & (1 << 4)) >> 4;
        card->csd.v1.FILE_FORMAT = (c[14] & 0x0C) >> 2;
        card->csd.v1.CSD_CRC = c[15];
        card->csd_structure = SD_CSD_V1;
        return SD_RW_OK;
      } else if (SD_GET_CSD_STRUCTURE(c) == SD_CSD_V2) {
        card->csd.v2.CSD_STRUCTURE = c[0] >> 6;
        card->csd.v2.TAAC = c[1];
        card->csd.v2.NSAC = c[2];
        card->csd.v2.TRAN_SPEED = c[3];
        card->csd.v2.CCC = (c[4] << 4) | ((c[5] & 0xF0) >> 4);
        card->csd.v2.READ_BL_LEN = (c[5] & 0x0F);
        card->csd.v2.READ_BL_PARTIAL = (c[6] & (1 << 7)) >> 7;
        card->csd.v2.WRITE_BLK_MISALIGN = (c[6] & (1 << 6)) >> 6;
        card->csd.v2.READ_BLK_MISALIGN = (c[6] & (1 << 5)) >> 5;
        card->csd.v2.DSR_IMP = (c[6] & (1 << 4)) >> 4;
        card->csd.v2.C_SIZE = (((uint32_t)c[7] & 0x3F) << 16) | (c[8] << 8) | c[9];
        card->csd.v2.ERASE_BLK_EN = (c[10] & (1 << 6)) >> 6;
        card->csd.v2.SECTOR_SIZE = (c[10] & 0x3F) << 1 | (c[11] >> 7);
        card->csd.v2.WP_GRP_SIZE = (c[11] & 0x7F);
        card->csd.v2.WP_GRP_ENABLE = (c[12] & (1 << 7)) >> 7;
        card->csd.v2.R2W_FACTOR = (c[12] & 0x1C) >> 2;
        card->csd.v2.WRITE_BL_LEN = ((c[12] & 0x03) << 2) | (c[13] >> 6);
        card->csd.v2.WRITE_BL_PARTIAL = (c[13] & (1 << 5)) >> 5;
        card->csd.v2.FILE_FORMAT_GRP = (c[14] & (1 << 7)) >> 7;
        card->csd.v2.COPY = (c[14] & (1 << 6)) >> 6;
        card->csd.v2.PERM_WRITE_PROTECT = (c[14] & (1 << 5)) >> 5;
        card->csd.v2.TMP_WRITE_PROTECT = (c[14] & (1 << 4)) >> 4;
        card->csd.v2.FILE_FORMAT = (c[14] & 0x0C) >> 2;
        card->csd.v2.CSD_CRC = c[15];
        card->csd_structure = SD_CSD_V2;
        return SD_RW_OK;
      } else {
        return SD_RW_NOT_SUPPORTED;
      }

    } else {
      return SD_RW_CRC_MISMATCH;
    }
  }
  return state;
}

uint64_t sdcard_spi_get_capacity(sdcard_info_t *card)
{
    if (card->csd_structure == SD_CSD_V1) {
        uint32_t block_len = (1 << card->csd.v1.READ_BL_LEN);
        uint32_t mult = 1 << (card->csd.v1.C_SIZE_MULT + 2);
        uint32_t blocknr = (card->csd.v1.C_SIZE + 1) * mult;
        return blocknr * block_len;
    }
    else if (card->csd_structure == SD_CSD_V2) {
        return (card->csd.v2.C_SIZE + 1) * (((uint64_t)SD_HC_BLOCK_SIZE) << 10);
    }
    return 0;
}

uint32_t sdcard_spi_get_sector_count(sdcard_info_t *card)
{
    return sdcard_spi_get_capacity(card) / SD_HC_BLOCK_SIZE;
}
